venkatarajasekhar/TI-CC3200-BleFi/src/example/blefi/cc26xxdnld.c
//*****************************************************************************
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/ 
// 
// 
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//    Redistributions of source code must retain the above copyright 
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the 
//    documentation and/or other materials provided with the   
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************


// Driverlib includes

//-----------------------------------------------------------------------------
/** \brief Send command.
 *
 * \param[in] ui32Cmd
 *      The command to send.
 * \param[in] pcSendData
 *      Pointer to the data to send with the command.
 * \param[in] ui32SendLen
 *      The number of bytes to send from \e pcSendData.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------

#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include "datatypes.h"
#include "osi.h"
#include "rom.h"
#include "rom_map.h"
#include "hw_memmap.h"
#include "hw_types.h"
#include "uart.h"
#include <simplelink.h>

#define SBL_CC2650_PAGE_ERASE_SIZE          4096
#define SBL_CC2650_FLASH_START_ADDRESS      0x00000000
#define SBL_CC2650_RAM_START_ADDRESS        0x20000000
#define SBL_CC2650_ACCESS_WIDTH_32B         1
#define SBL_CC2650_ACCESS_WIDTH_8B          0
#define SBL_CC2650_PAGE_ERASE_TIME_MS       20
#define SBL_CC2650_MAX_BYTES_PER_TRANSFER   252
#define SBL_CC2650_FLASH_SIZE_CFG           0x4003002C
#define SBL_CC2650_RAM_SIZE_CFG             0x40082250
#define SBL_CC2650_BL_CONFIG_PAGE_OFFSET    0xFDB
#define SBL_CC2650_BL_CONFIG_ENABLED_BM     0xc5
#define SBL_CC2650_MAX_BYTES_PER_TRANSFER   252
#define CRC_BLOCK_SIZE						200


enum {
	CMD_PING             = 0x20,
	CMD_DOWNLOAD         = 0x21,
	CMD_GET_STATUS       = 0x23,
	CMD_SEND_DATA        = 0x24,
	CMD_RESET            = 0x25,
	CMD_SECTOR_ERASE	 = 0x26,
	CMD_CRC32            = 0x27,
	CMD_GET_CHIP_ID      = 0x28,
	CMD_MEMORY_READ      = 0x2A,
	CMD_MEMORY_WRITE     = 0x2B,
	CMD_BANK_ERASE		 = 0x2C,
	CMD_SET_CCFG         = 0x2D,
};


enum {
    CMD_RET_SUCCESS      = 0x40,
    CMD_RET_UNKNOWN_CMD  = 0x41,
    CMD_RET_INVALID_CMD  = 0x42,
    CMD_RET_INVALID_ADR  = 0x43,
    CMD_RET_FLASH_FAIL   = 0x44,
};


#define SBL_PORT_ERROR (-1)
#define SBL_ARGUMENT_ERROR 2

#define DEVICE_ACK 1
#define DEVICE_NACK 0

#define SBL_FALSE 0
#define SBL_TRUE 1

#define SBL_SUCCESS 0
#define SBL_ERROR 1

#define sbl_send(x) MAP_UARTCharPut(UARTA0_BASE,x)
#define sbl_recv() MAP_UARTCharGet(UARTA0_BASE)

#define USER_FILE_NAME "cc26xx.bin"

#define CC26XX_FW_UPDATE_NEEDED 	1
#define CC26XX_FW_UPDATE_NOTNEEDED 	0

/*
 * EXTERN VARIABKES
 *
 **/
extern blefiCfg_t blefiCfgRec;


/**
 * Function Definitions
 * */
unsigned char addressInFlash(unsigned int ui32StartAddress,
                                         unsigned int ui32ByteCount/* = 1*/);
unsigned int cmdDownload(unsigned int ui32Address, unsigned int ui32Size);
unsigned int cmdSendData(const char *pcData, unsigned int ui32ByteCount);
unsigned int sendAutoBaud();
unsigned int sendCmd(unsigned int ui32Cmd, const char *pcSendData/* = NULL*/,
		unsigned int ui32SendLen/* = 0*/);
unsigned int writeFlashRange(unsigned int ui32StartAddress);
unsigned int sbl_min(unsigned int a, unsigned int b);
void sbl_close_bin(void);





//-----------------------------------------------------------------------------
/*
 * CC3200 functions related to SBL
 *
 */
//-----------------------------------------------------------------------------

long sblFileHandle;

//-----------------------------------------------------------------------------
/** Function sbl_min
*\brief
 *
 *
 */
//-----------------------------------------------------------------------------
unsigned int sbl_min(unsigned int a, unsigned int b)
{
	if (a<b)
	{
		return(a);
	}
	return(b);

}


//-----------------------------------------------------------------------------
/**\ FUNCTION
 *
 *
 */
//-----------------------------------------------------------------------------
unsigned int sbl_get_bin_size()
{
	SlFsFileInfo_t  	pFsFileInfo;
	int lRetVal;
	lRetVal = sl_FsGetInfo((unsigned char *)USER_FILE_NAME,0,&pFsFileInfo);
	if(lRetVal < 0)
	{
		Message("\n\rError Opening the file");
		return(0);
	}
	return(pFsFileInfo.FileLen);
}


//-----------------------------------------------------------------------------
/**\ FUNCTION
 *
 *
 */
//-----------------------------------------------------------------------------
int sbl_open_bin_for_read()
{

    unsigned long ulToken;
    int lRetVal;
	//
	// open a user file for reading
	//
	lRetVal = sl_FsOpen((unsigned char *)USER_FILE_NAME,
					 FS_MODE_OPEN_READ,
					 &ulToken,
					 &sblFileHandle);

	if(lRetVal < 0)
	{
		sl_FsClose(sblFileHandle, 0, 0, 0);
		Message("\n\rERROR - Could not open the file");
		return(lRetVal);
	}
	return 0;
}


