venkatarajasekhar/TI-CC3200-BleFi/src/example/blefi/cc26xxdnld.c
//-----------------------------------------------------------------------------
/**\brief This function closes the SBL binary file
 *
 *
 */
//-----------------------------------------------------------------------------
void sbl_close_bin()
{
	//
	// close the user file
	//
	sl_FsClose(sblFileHandle, 0, 0, 0);

}


//-----------------------------------------------------------------------------
/**\ FUNCTION
 *
 *
 */
//-----------------------------------------------------------------------------
int sbl_read_bin(unsigned int offset,unsigned char * pcData, unsigned int bytesInTransfer)
{
	return (sl_FsRead(sblFileHandle,offset,pcData,bytesInTransfer));
}


//-----------------------------------------------------------------------------
/** \brief This function sets the the SBL status and the SBL error string.
 *
 * \param[in] ui32Status
 *      The new SBL status. SBL_SUCCESS, SBL_ERROR, ...
 * \param[in] pcFormat
 *      'printf' like format string.
 * \param[in] ...
 *      Input variables to the \e pcFormat string.
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned char
generateCheckSum(unsigned int ui32Cmd, const char *pcData,
		unsigned int ui32DataLen)
{
	unsigned char ui8CheckSum = (unsigned char)ui32Cmd;
	unsigned int i;
    for(i = 0; i < ui32DataLen; i++)
    {
        ui8CheckSum += pcData[i];
    }
    return ui8CheckSum;
}


unsigned int
sendCmd(unsigned int ui32Cmd, const char *pcSendData/* = NULL*/,
		unsigned int ui32SendLen/* = 0*/)
{

    unsigned char pktLen = ui32SendLen + 3; // +3 => <1b Length>, <1B cksum>, <1B cmd>
    unsigned char pktSum = generateCheckSum(ui32Cmd, pcSendData, ui32SendLen);
    unsigned int i;

    //
    // Send packet
    //
    sbl_send(pktLen);
    sbl_send(pktSum);
    sbl_send((unsigned char)ui32Cmd);
    for(i=0;i<ui32SendLen;i++)
    {
    	sbl_send(*(pcSendData+i));
    }
    //
    // Empty and dealloc vector
    //
    return SBL_SUCCESS;
}


//-----------------------------------------------------------------------------
/** \brief Get ACK/NAK from the CC2650 device.
 *
 * \param[out] bAck
 *      True if response is ACK, false if response is NAK.
 * \param[in] ui32MaxRetries (optional)
 *      How many times ComPort::readBytes() can time out before fail is issued.
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned int
getCmdResponse(unsigned char * bAck)
{
    unsigned char pIn[2];
    unsigned int recvData = 0;
    *bAck = 0;
    unsigned int bytesRecv = 0;

    //
    // Expect 2 bytes (ACK or NAK)
    //

    do
    {
    	recvData = sbl_recv();
    	//Report("\n\r[%x]",recvData);
    	if((recvData&0x00000500) == 0)
    	{
    		pIn[bytesRecv]=(unsigned char) recvData;
    		bytesRecv += 1;
    		//Report("\n\r{%x}",bytesRecv);
    	}
    }
    while(bytesRecv < 2);

    if(bytesRecv < 2)
    {
         return SBL_ERROR;
    }
    else
    {
        if(pIn[0] == 0x00 && pIn[1] == 0xCC)
        {
            *bAck = DEVICE_ACK;
            return SBL_SUCCESS;
        }
        else if(pIn[0] == 0x00 && pIn[1] == 0x33)
        {
        	Report("\t\t Error - NACK\n\r");
            *bAck = DEVICE_NACK;
        	return SBL_SUCCESS;
        }
        else
        {
        	Report("\t\t Error - Device did not respond with ACK or NACK\n\r");
            return SBL_ERROR;
        }
    }

}


//-----------------------------------------------------------------------------
/** \brief Send auto baud.
 *
 * \param[out] bBaudSetOk
 *      True if response is ACK, false otherwise
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned int
sendAutoBaud()
{
    unsigned char bBaudSetOk = 0;
    //
    // Send 0x55 0x55 and expect ACK
    //

    sbl_send(0x55);
    sbl_send(0x55);

    if(getCmdResponse(&bBaudSetOk) != SBL_SUCCESS)
    {
        // No response received. Invalid baud rate?

    	Report("\t\t Error - Device did not receive Auto Baud Command. Invalid baud rate\n\r");
         return SBL_ERROR;
    }

    return SBL_SUCCESS;
}


//-----------------------------------------------------------------------------
/** \brief Get response data from CC2650 device.
 *
 * \param[out] pcData
 *      Pointer to where received data is stored.
 * \param[in|out] ui32MaxLen
 *      Max number of bytes that can be received. Is populated with the actual
 *      number of bytes received.
 * \param[in] ui32MaxRetries (optional)
 *      How many times ComPort::readBytes() can time out before fail is issued.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned int
getResponseData(char *pcData, unsigned int *ui32MaxLen)
{
	char pcHdr[2];
    unsigned int numPayloadBytes;
    unsigned char hdrChecksum, dataChecksum;
    unsigned int bytesRecv = 0;

    //
    // Read length and checksum
    //
    do
	{
	 pcHdr[bytesRecv]=(unsigned char) sbl_recv();
	 bytesRecv += 1;
	}
	while(bytesRecv < 2);

    numPayloadBytes = pcHdr[0]-2;
    hdrChecksum = pcHdr[1];

    //
    // Check if length byte is too long.
    //
    if(numPayloadBytes > *ui32MaxLen)
    {
    	Report("\t\t Error - payload length byte is too long \n\r");
    	return SBL_ERROR;
    }

    //
    // Read the payload data
    //
    bytesRecv = 0;

    do
    {
    	*(pcData+bytesRecv) = (unsigned char) sbl_recv();
    	bytesRecv++;
    }
    while(bytesRecv < numPayloadBytes);

    //
    // Verify data checksum
    //
    dataChecksum = generateCheckSum(0, pcData, numPayloadBytes);
    if(dataChecksum != hdrChecksum)
    {
    	Report("\t\t Error - Data Checksum\n\r");
    	return SBL_ERROR;
    }

    *ui32MaxLen = bytesRecv;
    return SBL_SUCCESS;
}

//-----------------------------------------------------------------------------
/** \brief Send command response (ACK/NAK) to CC2650 device.
 *
 * \param[in] bAck
 *      True if response is ACK, false if response is NAK.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned int
sendCmdResponse(unsigned char bAck)
{

    //
    // Send response
    //
   	sbl_send(0x00);
    sbl_send((bAck) ? 0xCC : 0x33);
    //Report("\t\t Sending Command response to CC2650 device\n\r");
    return SBL_SUCCESS;
}


