venkatarajasekhar/TI-CC3200-BleFi/src/example/blefi/cc26xxdnld.c
//-----------------------------------------------------------------------------
/** \brief Get status from device.
 *
 * \param[out] pStatus
 *      Pointer to where status is stored.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned int
readStatus(unsigned int *pui32Status)
{
	unsigned int retCode = SBL_SUCCESS;
	unsigned char bSuccess = SBL_FALSE;

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_GET_STATUS,0,0)) != SBL_SUCCESS)
    {
    	Report("\t\t Error - Send Cmd Fail\n\r");
        return retCode;
    }

    //
    // Receive command response
    //
    if((retCode = getCmdResponse(&bSuccess)) != SBL_SUCCESS)
    {
    	Report("\t\t Error - Cmd Response Fail\n\r");
        return retCode;
    }

    if(!bSuccess)
    {
    	Report("\t\t Error - Not  able to get device status\n\r");
    	return SBL_ERROR;
    }

    //
    // Receive command response data
    //
    char status = 0;
    unsigned int ui32NumBytes = 1;
    if((retCode = getResponseData(&status, &ui32NumBytes)) != SBL_SUCCESS)
    {
        //
        // Respond with NAK
        //
        sendCmdResponse(SBL_FALSE);
        return retCode;
    }

    //
    // Respond with ACK
    //
    sendCmdResponse(SBL_TRUE);
    *pui32Status = status;
    return SBL_SUCCESS;
}


//-----------------------------------------------------------------------------
/** \brief Utility function for splitting 32 bit variable into char array
 *      (4 elements). Data are converted MSB, ie. \e pcDst[0] is the
 *      most significant byte.
 *
 * \param[in] ui32Src
 *      The 32 bit variable to convert.
 * \param[out] pcDst
 *      Pointer to the char array where the data is stored.
 *
 * \return
 *      void
 */
//-----------------------------------------------------------------------------
/*static */void
ulToCharArray(const unsigned int ui32Src, char *pcDst)
{
    // MSB first
    pcDst[0] =  (unsigned char)(ui32Src >> 24);
    pcDst[1] =  (unsigned char)(ui32Src >> 16);
    pcDst[2] =  (unsigned char)(ui32Src >> 8);
    pcDst[3] =  (unsigned char)(ui32Src >> 0);
}

unsigned int eraseFlashRange(unsigned int ui32StartAddress,unsigned int ui32ByteCount)
{
	unsigned int retCode = SBL_SUCCESS;
	unsigned char bSuccess = SBL_FALSE;
    char pcPayload[4];
    unsigned int devStatus;
    unsigned int i;


    //
    // Calculate retry count
    //
    unsigned int ui32PageCount = ui32ByteCount / SBL_CC2650_PAGE_ERASE_SIZE;
    if( ui32ByteCount % SBL_CC2650_PAGE_ERASE_SIZE) ui32PageCount ++;
	for( i = 0; i < ui32PageCount; i++)
	{

		//
		// Build payload
		// - 4B address (MSB first)
		//
		ulToCharArray(ui32StartAddress + i*(4096), &pcPayload[0]);

		//
		// Send command
		//
		if((retCode = sendCmd(CMD_SECTOR_ERASE, pcPayload, 4)) != SBL_SUCCESS)
		{
			return retCode;
		}

		//
		// Receive command response (ACK/NAK)
		//
		if((retCode = getCmdResponse(&bSuccess)) != SBL_SUCCESS)
		{
			return retCode;
		}
		if(!bSuccess)
		{
			Report("\t\t Error - Payload is not right \n\r");
			return SBL_ERROR;
		}

		//
		// Check device status (Flash failed if page(s) locked)
		//
		readStatus(&devStatus);
		if(devStatus != CMD_RET_SUCCESS)
		{
			Report("\t\t Error - Device Flash has failed or FLash page(s) are locked\n\r");
			return SBL_ERROR;
		}

	}
    return SBL_SUCCESS;
}


// Calculate crc32 checksum the way CC2538 and CC2650 does it.
int calcCrcLikeChip(const unsigned char *pData, unsigned long ulByteCount)
{
    unsigned long d, ind;
    unsigned long acc = 0xFFFFFFFF;
    const unsigned long ulCrcRand32Lut[] =
    {
        0x00000000, 0x1DB71064, 0x3B6E20C8, 0x26D930AC,
        0x76DC4190, 0x6B6B51F4, 0x4DB26158, 0x5005713C,
        0xEDB88320, 0xF00F9344, 0xD6D6A3E8, 0xCB61B38C,
        0x9B64C2B0, 0x86D3D2D4, 0xA00AE278, 0xBDBDF21C
    };

    while ( ulByteCount-- )
    {
        d = *pData++;
        ind = (acc & 0x0F) ^ (d & 0x0F);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
        ind = (acc & 0x0F) ^ (d >> 4);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
    }

    return (acc ^ 0xFFFFFFFF);
}


//-----------------------------------------------------------------------------
/** \brief Write \e unitCount words of data to device FLASH. Source array is
 *      8 bit wide. Parameters \e startAddress and \e unitCount must be a
 *      a multiple of 4. This function does not erase the flash before writing
 *      data, this must be done using e.g. eraseFlashRange().
 *
 * \param[in] ui32StartAddress
 *      Start address in device. Must be a multiple of 4.
 * \param[in] ui32ByteCount
 *      Number of bytes to program. Must be a multiple of 4.
 * \param[in] pcData
 *      Pointer to source data.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned int
writeFlashRange(unsigned int ui32StartAddress)
{
	//unsigned int devStatus = CMD_RET_UNKNOWN_CMD;
	unsigned int retCode = SBL_SUCCESS;
	unsigned int bytesLeft, bytesInTransfer;
	unsigned int transferNumber = 0;
	unsigned int ui32ByteCount;
    unsigned char pcData[SBL_CC2650_MAX_BYTES_PER_TRANSFER];
    unsigned int devStatus;



    ui32ByteCount = sbl_get_bin_size();
    if(ui32ByteCount==0)
    {
    	Report("\n\rERROR - Binary not present");
    	return SBL_ERROR;
    }

    //
    //Send command to Erase the CC26xx flash
    //
    eraseFlashRange(ui32StartAddress,ui32ByteCount);

    //
	// Send download command to CC26xx
	//
	if((retCode = cmdDownload(ui32StartAddress,
			ui32ByteCount)) != SBL_SUCCESS)
	{
		return retCode;
	}

	//
	// Check status after download command
	//
	retCode = readStatus(&devStatus);
	if(retCode != SBL_SUCCESS)
	{
	   return retCode;
	}
	if(devStatus != CMD_RET_SUCCESS)
	{
	   return SBL_ERROR;
	}


	if( sbl_open_bin_for_read() <0)
	{
		Report("\n\rERROR - Binary cannot be read");
		return SBL_ERROR;
	}

	//
	// Send data in chunks
	//
	bytesLeft = ui32ByteCount;

	while(bytesLeft)
	{

		//
		// Limit transfer count
		//
		bytesInTransfer = sbl_min(SBL_CC2650_MAX_BYTES_PER_TRANSFER, bytesLeft);
		//Report("\n\rAdds:%x, count :%d, bytes-left :%d ",(ui32ByteCount-bytesLeft),transferNumber,bytesLeft);
		Report("\rbytes-left :%6d ",bytesLeft);

		//Read from SFLASH, and store it in pcData
		sbl_read_bin((unsigned int)(ui32ByteCount-bytesLeft),
				  pcData, bytesInTransfer);


		//
		// Send Data command
		//
		if((retCode = cmdSendData((const char *)pcData, bytesInTransfer)) != SBL_SUCCESS)
		{
			Report("\n\rError during flash download - Send Data");
			sbl_close_bin();
			//Report("FILL THIS");
			return retCode;

