venkatarajasekhar/TI-CC3200-BleFi/src/example/blefi/cc26xxdnld.c
		}


		devStatus = 0;
		retCode = readStatus(&devStatus);
		if(retCode != SBL_SUCCESS)
		{
			Report("\n\rError during flash download-Read Status");
			sbl_close_bin();
		}
		if(devStatus != CMD_RET_SUCCESS)
		{
			Report("Device returned status %d\n", devStatus);
			continue;
		}
					//
		// Update index and bytesLeft
		//
		bytesLeft -= bytesInTransfer;
		transferNumber++;
	}

	//
	// close the user file
	//
	sbl_close_bin();
    return SBL_SUCCESS;
}


//-----------------------------------------------------------------------------
/** \brief This function sends the CC2650 download command and handles the
 *      device response.
 *
 * \param[in] ui32Address
 *      The start address in CC2650 flash.
 * \param[in] ui32ByteCount
 *      The total number of bytes to program on the device.
 *
 * \return
 *      Returns SBL_SUCCESS if command and response was successful.
 */
//-----------------------------------------------------------------------------
unsigned int
cmdDownload(unsigned int ui32Address, unsigned int ui32Size)
{
    int retCode = SBL_SUCCESS;
    unsigned char bSuccess = SBL_FALSE;


    //
    // Check input arguments
    //
    if(!addressInFlash(ui32Address, ui32Size))
    {
        //setState(SBL_ARGUMENT_ERROR, "Flash download: Address range (0x%08X + %d bytes) is not in device FLASH nor RAM.\n", ui32Address, ui32Size);
        return SBL_ARGUMENT_ERROR;
    }
    if(ui32Size & 0x03)
    {
        //setState(SBL_ARGUMENT_ERROR, "Flash download: Byte count must be a multiple of 4\n");
        return SBL_ARGUMENT_ERROR;
    }

    //
    // Generate payload
    // - 4B Program address
    // - 4B Program size
    //
    char pcPayload[8];
    ulToCharArray(ui32Address, &pcPayload[0]);
    ulToCharArray(ui32Size, &pcPayload[4]);

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_DOWNLOAD, pcPayload, 8)) != SBL_SUCCESS)
    {
        return retCode;
    }

    //
    // Receive command response (ACK/NAK)
    //
    if((retCode = getCmdResponse(&bSuccess)) != SBL_SUCCESS)
    {
        return retCode;
    }

    //
    // Return command response
    //
    return (bSuccess) ? SBL_SUCCESS : SBL_ERROR;
}



//-----------------------------------------------------------------------------
/** \brief This function sends the CC2650 SendData command and handles the
 *      device response.
 *
 * \param[in] pcData
 *      Pointer to the data to send.
 * \param[in] ui32ByteCount
 *      The number of bytes to send.
 *
 * \return
 *      Returns SBL_SUCCESS if command and response was successful.
 */
//-----------------------------------------------------------------------------
unsigned int
cmdSendData(const char *pcData, unsigned int ui32ByteCount)
{
    unsigned int retCode = SBL_SUCCESS;
    unsigned char bSuccess = SBL_FALSE;

    //
    // Check input arguments
    //
    if(ui32ByteCount > SBL_CC2650_MAX_BYTES_PER_TRANSFER)
    {
       // setState(SBL_ERROR, "Error: Byte count (%d) exceeds maximum transfer size %d.\n", ui32ByteCount, SBL_CC2650_MAX_BYTES_PER_TRANSFER);
    	Report("\n\r Send Data : Error 1");
        return SBL_ERROR;
    }

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_SEND_DATA, pcData, ui32ByteCount)) != SBL_SUCCESS)
    {
    	Report("\n\r Send Data : Error 2 : %d",retCode);
        return retCode;
    }

    //
    // Receive command response (ACK/NAK)
    //
    if((retCode = getCmdResponse(&bSuccess)) != SBL_SUCCESS)
    {
        return retCode;
    }
    if(!bSuccess)
    {
    	Report("\n\r Send Data : Error 3 : %d",bSuccess);
        return SBL_ERROR;
    }

    return SBL_SUCCESS;
}

//-----------------------------------------------------------------------------
/** \brief This function checks if the specified \e ui32StartAddress (and range)
 *      is located within the device RAM area.
 *
 * \return
 *      Returns true if the address/range is within the device RAM.
 */
//-----------------------------------------------------------------------------
unsigned char
addressInFlash(unsigned int ui32StartAddress,
                                         unsigned int ui32ByteCount/* = 1*/)
{
#if 0
    unsigned int ui32EndAddr = ui32StartAddress + ui32ByteCount;
    if(ui32StartAddress < SBL_CC2650_FLASH_START_ADDRESS)
    {
        return SBL_FALSE;
    }
    if(ui32EndAddr > (SBL_CC2650_FLASH_START_ADDRESS + getFlashSize()))
    {
        return SBL_FALSE;
    }
#endif
    return SBL_TRUE;
}


void Do_SBL_Dnld()
{
    sendCmd(0,0,0);
    //Report("SENDCOMMAND Sent\n\r");
    if(sendAutoBaud()==SBL_ERROR)
    {
    	Report("ERROR - Auto Baud Command Not Sent\n\r");
    }
    else
    {
    	Report("Downloading Firmware to CC26XX\n\r");
    	writeFlashRange(0x0);
    }
}


unsigned char CC26xx_SBL_CheckIfUpdateFwNeeded()
{
    int lRetVal;
	unsigned long ulByteCount;
	unsigned char *cc26xxData;
	SlFsFileInfo_t  	pFsFileInfo;
    long lFileHandle;
    unsigned long ulToken;
    unsigned int cc26xxCrc = 0x0;
//    unsigned char crcAvailFlag = (unsigned char)CRC_FILE_ABSENT_FLAG;
    unsigned int bytesLeft, bytesInTransfer;
	unsigned int transferNumber = 0;

	// Is cc26xx.bin present is Flash?
    lRetVal = sl_FsGetInfo((unsigned char *)USER_FILE_NAME,0,&pFsFileInfo);
    if(lRetVal < 0)
    {
    	Message("\n\r[SBL] No cc26xx.bin file to update");
    	return(CC26XX_FW_UPDATE_NOTNEEDED); // no update
    }
    // execution reaches here only if the CC26XX bin file is present
    // file is present in Flash . check if update is needed

	// read cc26xx.bin file from flash
	ulByteCount = pFsFileInfo.FileLen;
	//
	// open a user file for reading
	//
	lRetVal = sl_FsOpen((unsigned char *)USER_FILE_NAME,
						 FS_MODE_OPEN_READ,
						 &ulToken,
						 &lFileHandle);
    if(lRetVal < 0)
    {
		 lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
		 Message("\n\r[SBL] Could not open the cc26xx.bin file");
		 return (0);
	}
    // cc26xx.bin file present. Now calculate crc
	cc26xxData = (unsigned char *)malloc(CRC_BLOCK_SIZE);
	if (cc26xxData == NULL)
	{
		Message("\n\r[SBL] NOT ENOUGH MEMORY TO CALCULATE THE CRC OF cc26xx.bin file");
		lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
		// could'nt open crc.bin file . Update anyway.
		return (1);
	}

	// Now start calculating CRC of the bin file
	bytesLeft = ulByteCount;
	// Initialising before CRC calculation
	while(bytesLeft)
	{
		bytesInTransfer = sbl_min(CRC_BLOCK_SIZE, bytesLeft);

		// Enable this only for debug
		//Report("\n\rAdds:%x, count :%d ",(ulByteCount-bytesLeft),transferNumber);


		lRetVal = sl_FsRead(lFileHandle,
						  (unsigned int)(ulByteCount-bytesLeft),
						  cc26xxData, bytesInTransfer);

		//
		// Calculate CRC from USER_FILE_NAME
		//
		 cc26xxCrc = calcCrcLikeChip((const unsigned char *)cc26xxData, bytesInTransfer);		//
		// Update index and bytesLeft
		//
		bytesLeft -= bytesInTransfer;
		transferNumber++;
	}
	// End calculating CRC on bin file
	free(cc26xxData);

	lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);

	//Read the CRC value that is stored in the CRC file stored in SFLASH
	if(cc26xxCrc!=*(blefiCfgRec.cc26xxCRC))
	{
	  Report("\n\r[SBL] stored crc %x, 26xx file crc %x",*(blefiCfgRec.cc26xxCRC),cc26xxCrc);
		//Update needed
	  *(blefiCfgRec.cc26xxCRC) = cc26xxCrc;
	  return(1);
	}
	else
	{
		//Update not needed
	  return(0);
	}

}



//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

    

